I-PRT002-G001=\u96fb\u5b50\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u304c\u3042\u308a\u307e\u305b\u3093\u3002
E-PRT003-G001=\u53d7\u4ed8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-PRT003-G002=\u4e00\u6642\u7684\u306a\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\n\u30c1\u30b1\u30c3\u30c8\u914d\u4fe1\u30e1\u30fc\u30eb\u3092\u65bd\u8a2d\u30b9\u30bf\u30c3\u30d5\u3078\u63d0\u793a\u306e\u4e0a\u3001\u305d\u306e\u65e8\u3092\u304a\u4f1d\u3048\u304f\u3060\u3055\u3044\u3002
E-PRT003-G003=\u8868\u793a\u3055\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u6709\u52b9\u671f\u9650\u5916\u306e\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
E-PRT003-G004=\u8868\u793a\u3055\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3001\u3054\u78ba\u8a8d\u304a\u9858\u3044\u81f4\u3057\u307e\u3059\u3002
E-PRT003-G005=\u8868\u793a\u3055\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u8cfc\u5165\u304c\u30ad\u30e3\u30f3\u30bb\u30eb\u3055\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
E-PRT003-G006=\u8868\u793a\u3055\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u306f\u4f7f\u7528\u6e08\u307f\u3067\u3059\u3002
E-PRT003-G007=\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-PRT003-G008=QR\u30b3\u30fc\u30c9\u751f\u6210\u5931\u6557\u3057\u307e\u3057\u305f\u3001\u3054\u78ba\u8a8d\u304a\u9858\u3044\u81f4\u3057\u307e\u3059\u3002
E-PRT003-G009=\u64cd\u4f5c\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002\u30c1\u30b1\u30c3\u30c8\u4e00\u89a7\u304b\u3089\u60c5\u5831\u3092\u518d\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-PRT006-G004={0}\u306b\u8aa4\u308a\u304c\u3042\u308a\u307e\u3059\u3002
E-PRT007-G001=\u5206\u914d\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-PRT007-G002=\u518d\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-EMP001-G001=\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
W-EMP003-G001=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u7d10\u3065\u304f\u5546\u54c1\u306e\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u3092\u4e0a\u8a18\u5185\u5bb9\u306b\u5909\u66f4\u3057\u307e\u3059\u3002<br>\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
I-EMP003-G002=\u5546\u54c1\u60c5\u5831\u3092\u5909\u66f4\u3057\u307e\u3057\u305f\u3002
W-EMP003-G003=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u3092\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u3057\u307e\u3059\u3002<br>\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
W-EMP003-G004=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306e\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u307e\u3059\u3002<br>\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
I-EMP003-G005=\u30c1\u30b1\u30c3\u30c8\u3092\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u3057\u307e\u3057\u305f\u3002
I-EMP003-G006=\u30c1\u30b1\u30c3\u30c8\u306e\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u307e\u3057\u305f\u3002
W-EMP003-G007=\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3092\u958b\u59cb\u3057\u307e\u3059\u3002<br>\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
W-EMP003-G008=\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u30c7\u30fc\u30bf\u304c0\u4ef6\u3067\u3057\u305f\u3002\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u6761\u4ef6\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
W-EMP003-G009=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306e\u53d7\u4ed8No\u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
W-EMP003-G010=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u6e08\u306e\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
W-EMP003-G011=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u6709\u52b9\u671f\u9650\u5916\u306e\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
W-EMP003-G012=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u6e08\u307f\u3067\u306a\u3044\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
W-EMP003-G013=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306e\u5546\u54c1\u30b3\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093\u3002
W-EMP003-G014=\u66f4\u65b0\u5bfe\u8c61\u306f\u3042\u308a\u307e\u305b\u3093\u3002
W-EMP003-G015=\u9078\u629e\u3057\u305f\u30c1\u30b1\u30c3\u30c8\u306b\u8cfc\u5165\u30ad\u30e3\u30f3\u30bb\u30eb\u306e\u30c1\u30b1\u30c3\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
W-EMP007-G001={0}\u306e\u5165\u529b\u5024\u304c\u4e0d\u6b63\u3067\u3059\u3002
W-EMP007-G002=\u3053\u306e\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306f\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
W-EMP007-G003=\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u306b\u306a\u308a\u307e\u3059\u3002
E-EMP007-G001=\u30a2\u30ab\u30a6\u30f3\u30c8\u767b\u9332\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-EMP007-G002=ID/\u65bd\u8a2d\u540d\u306f\u5fc5\u9808\u3067\u3059\u3002
I-EMP007-G001=\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u65b0\u898f\u8ffd\u52a0\u3057\u307e\u3057\u305f\u3002
I-EMP007-G002=\u7de8\u96c6\u5185\u5bb9\u3092\u65b0\u898f\u8ffd\u52a0\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
I-EMP008-G001=\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u66f4\u65b0\u3057\u307e\u3057\u305f\u3002
I-EMP008-G002=\u5bfe\u8c61\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u60c5\u5831\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
I-EMP008-G003=\u7de8\u96c6\u5185\u5bb9\u3092\u66f4\u65b0\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
W-APP00-1-G001=\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-FNC0021-L001=\u65e2\u306b\u53d6\u8fbc\u6e08\u307f\u306e\u8cfc\u5165\u60c5\u5831\u3067\u3059\u3002
E-FNC0023-L001=\u65e2\u306b\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u6e08\u307f\u306e\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u3067\u3059\u3002{0}
E-FNC0023-L002=\u65e2\u306b\u8cfc\u5165\u30ad\u30e3\u30f3\u30bb\u30eb\u6e08\u307f\u306e\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u3067\u3059\u3002{0}
E-FNC0023-L003=\u3053\u306e\u30c1\u30b1\u30c3\u30c8\u306f\u6709\u52b9\u671f\u9650\u5916\u3067\u3059\u3002{0}
E-FNC0025-G001=\u53d7\u4ed8\u756a\u53f7\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
E-FNC0025-G002=\u53d7\u4ed8\u756a\u53f7\u304c\u30ad\u30e3\u30f3\u30bb\u30eb\u6e08\u307f\u3002
E-FNC0025-G003=\u53d7\u4ed8\u756a\u53f7\u5185\u306e\u30c1\u30b1\u30c3\u30c8\u304c\u4f7f\u7528\u6e08\u307f\u3002
E-FNC0025-G004=\u6709\u52b9\u671f\u9650\u5207\u308c\u305f\u30c1\u30b1\u30c3\u30c8\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
E-EMP004-G004=\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
I-EMP006-G001=\u524a\u9664\u3057\u307e\u3057\u305f\u3002
I-EMP006-G002=\u30c1\u30a7\u30c3\u30af\u3057\u305f\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u524a\u9664\u3057\u307e\u3059\u304b\u3002
E-EMP006-G001=\u81ea\u5206\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u9078\u629e\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
E-APP001-G001=\u4ed6\u30e6\u30fc\u30b6\u30fc\u304b\u3089\u5909\u66f4\u51e6\u7406\u304c\u5b9f\u884c\u3055\u308c\u305f\u305f\u3081\u51e6\u7406\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u60c5\u5831\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
I-APP001-G001=\u30c1\u30a7\u30c3\u30af\u30a4\u30f3\u306b\u6210\u529f\u3057\u307e\u3057\u305f\u3002
W-PRT007-G001=\u9078\u629e\u30da\u30fc\u30b8ID\u306e\u95a2\u9023\u30c1\u30b1\u30c3\u30c8\u60c5\u5831\u304c\u3042\u308a\u307e\u305b\u3093\u3002
W-PRT007-G002=\u9078\u629e\u30da\u30fc\u30b8ID\u306e\u5206\u914d\u30b3\u30fc\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
E-PRT007-G003=\u30e1\u30fc\u30eb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u5185\u5bb9\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
I-CMN-G001=\u691c\u7d22\u7d50\u679c\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\n\u691c\u7d22\u6761\u4ef6\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
W-CMN-G001=\u691c\u7d22\u6761\u4ef6\u3092\u30af\u30ea\u30a2\u3057\u307e\u3059\u3002<br>\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
W-CMN-G002=\u7de8\u96c6\u5185\u5bb9\u304c\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u304c\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
W-CMN-G003={0}\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
W-CMN-G004={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
W-CMN-G005=\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u65e2\u306b\u66f4\u65b0\u6e08\u307f\u3067\u3059\u3002
E-CMN-G001=\u30c7\u30fc\u30bf\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G002=\u30c7\u30fc\u30bf\u306e\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G003=\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u51e6\u7406\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\n\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G004={0}\u306f\u5fc5\u9808\u3067\u3059\u3002
E-CMN-G005={0}\u6587\u5b57\u4ee5\u4e0a{1}\u6587\u5b57\u4ee5\u4e0b\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-CMN-G006={0}\u306f\u534a\u89d2\u82f1\u6570\u8a18\u53f7\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-CMN-G007=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G008=\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3059\u3002
E-CMN-G009=\u30b7\u30b9\u30c6\u30e0\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G010=\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-CMN-G011={0}\u306f\u534a\u89d2\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-CMN-G012={0}\u306f\u534a\u89d2\u6570\u5b57\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-CMN-G013={0}\u306e\u5165\u529b\u6587\u5b57\u6570\u306f{1}\u6841\u4ee5\u4e0b\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
E-CMN-G014=\u30a2\u30af\u30bb\u30b9\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G015=\u30a2\u30af\u30bb\u30b9\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-G016=\u30da\u30fc\u30b8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
I-CMN-L001={0}\u3092\u958b\u59cb\u3057\u307e\u3059\u3002
I-CMN-L002={0}\u3092\u7d42\u4e86\u3057\u307e\u3059\u3002
I-CMN-L003=\u30c7\u30fc\u30bf\u9023\u643a\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002:{0}
I-CMN-L004=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002:{0}
I-CMN-L005=\u30d0\u30c3\u30c1\u5b9f\u884c\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002:{0}
I-CMN-L006=\u6b63\u5e38\u7d42\u4e86\u3002
W-CMN-L001=\u30d5\u30a1\u30a4\u30eb{0}\u306e\u6709\u52b9\u30c7\u30fc\u30bf\u304c0\u4ef6\u306e\u305f\u3081\u3001\u51e6\u7406\u3092\u4e2d\u65ad\u3057\u307e\u3057\u305f\u3002
E-CMN-L001={0}\u30b9\u30c8\u30ec\u30fc\u30b8\u30d1\u30b9\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L002=\u30d5\u30a1\u30a4\u30eb{0}\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L003=\u30d5\u30a1\u30a4\u30eb{0}\u306e\u8aad\u307f\u8fbc\u307f\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L004=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L005={0}\u30c7\u30fc\u30bf\u9023\u643a\u30d5\u30a1\u30a4\u30eb\u306e\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L006={0}\u306e\u5b58\u5728\u6027\u30c1\u30a7\u30c3\u30af\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-CMN-L007=\u30c7\u30fc\u30bf\u306e\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L008=\u30c7\u30fc\u30bf\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002[\u5bfe\u8c61\u30c7\u30fc\u30bf\uff1a{0}]
E-CMN-L009=\u30c7\u30fc\u30bf\u304c\u4e0d\u6574\u5408\u306e\u305f\u3081\u3001\u691c\u7d22\u51e6\u7406\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-CMN-L010=\u30c7\u30fc\u30bf\u304c\u4e0d\u6574\u5408\u306e\u305f\u3081\u3001\u66f4\u65b0\u51e6\u7406\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-CMN-L011=\u30c7\u30fc\u30bf\u304c\u4e0d\u6574\u5408\u306e\u305f\u3081\u3001\u524a\u9664\u51e6\u7406\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
E-CMN-L012=API\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u5024\u304c\u4e0d\u6b63\u3067\u3059\u3002[\u30d1\u30e9\u30e1\u30fc\u30bf\uff1a{0}]
E-CMN-L013=\u5fc5\u9808\u9805\u76ee\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002[\u30d1\u30e9\u30e1\u30fc\u30bf\uff1a{0}]
E-CMN-L014=\u30b3\u30fc\u30c9\u307e\u305f\u306f\u533a\u5206\u5024\u304c\u4e0d\u6b63\u3067\u3059\u3002[\u30d1\u30e9\u30e1\u30fc\u30bf\uff1a{0}]
E-CMN-L015=\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u304c\u4e0d\u6b63\u3067\u3059\u3002[\u30d1\u30e9\u30e1\u30fc\u30bf\uff1a{0}]
E-CMN-L016=\u5185\u90e8\u4f8b\u5916\u304c\u767a\u751f\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u60c5\u5831\u3092\u63d0\u4f9b\u3067\u304d\u307e\u305b\u3093\u3002
E-CMN-L017=DB\u306b\u554f\u984c\u304c\u767a\u751f\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u60c5\u5831\u3092\u63d0\u4f9b\u3067\u304d\u307e\u305b\u3093\u3002[\u51e6\u7406\u540d\uff1a{0}]
E-CMN-L018=API\u5229\u7528\u8a31\u53ef\u304c\u3042\u308a\u307e\u305b\u3093\u3002
E-CMN-L019=\u65e2\u306b\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002
E-CMN-L020=\u672a\u77e5\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u5408\u305b\u304f\u3060\u3055\u3044\u3002
E-CMN-L021=\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u767a\u751f\u3057\u307e\u3057\u305f
